---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.ContainsKey(Autodesk.Revit.DB.ExportFontKey)
source: html/45137da1-46e2-e0a1-5eaf-e8ad58d18940.htm
---
# Autodesk.Revit.DB.ExportFontTable.ContainsKey Method

Checks whether a font key exists in the table.

## Syntax (C#)
```csharp
public bool ContainsKey(
	ExportFontKey exportfontKey
)
```

## Parameters
- **exportfontKey** (`Autodesk.Revit.DB.ExportFontKey`) - The export font Key.

## Returns
True if the font key exists in the table.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null